app/controllers/pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT 1
---
  def profile
    # Pegue a url do usuário através do id
  if (User.find_by_username(params[:id]))